Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-IT/tmx_teil_2.tmx
Source language: en
Languages: it

source: Splinting (Supportive -) for medical use
it: Stecche (Di supporto -) per uso medico

source: Refractometers for veterinary use
it: Rifrattometri per uso veterinario

source: Sensor apparatus for medical use in monitoring the vital signs of patients
it: Sensori per uso medico per il monitoraggio dei segni vitali dei pazienti

source: Separation cartridges for medical use in chromatography
it: Cartucce di separazione per uso medico nella cromatografia

source: Membranes for filtration [medical]
it: Membrane di filtraggio [mediche]

source: Mercury thermometers for medical use
it: Termometri a mercurio per uso medico

source: Goniometers for surgical use
it: Goniometri per uso chirurgico

source: Medical prostheses
it: Protesi per uso medico

source: Medical stockings with decreasing compression
it: Calze mediche a compressione decrescente

source: Endoscopes for medical use
it: Endoscopi per uso medico

source: Medical gas-insufflators
it: Insufflatori per gas medici

source: Medical apparatus for urethral catheterization
it: Apparecchi medici per la cateterizzazione uretrale

source: Medical apparatus for urological purposes
it: Apparecchi medici per uso urologico

source: Intracardiac catheter
it: Cateteri endocardiaci

source: Intravenous catheter sets
it: Set di cateteri endovenosi

source: Bags [fitted] for medical instruments
it: Borse [su misura] per strumenti medici

source: Surgical gloves
it: Guanti chirurgici

source: Lamps for use with medical instruments
it: Lampade da utilizzare con strumenti medici

source: Laser machining tools for medical use
it: Macchine utensili al laser per uso medico

source: Medical guidewires and parts and fittings therefor
it: Filo guida medico e relativi componenti e raccordi

source: Medical scissors
it: Forbici chirurgiche

source: Heat exchange anti-viral filters for medical use
it: Filtri anti-virali a scambio di calore per uso medico

source: Heat pads for therapeutic treatment
it: Termofori per trattamenti medici

source: Hooks for limb replacement
it: Ganci per sostituzione di arti

source: Humidifiers for use in medical treatment
it: Umidificatori per trattamenti medici

source: Laryngeal masks
it: Maschere laringali

source: Surgical perforators
it: Perforatori chirurgici

source: Thread, surgical
it: Fili per chirurghi

source: Anti-embolic filters
it: Filtri anti-embolia

source: Apparatus for analysing bacteria in biological samples [for medical use]
it: Apparecchi per l'analisi di batteri in campioni biologici [per uso medico]

source: Containers especially made for medical waste
it: Recipienti speciali per residui medici

source: Cryoprobes for medical use
it: Criosonde per uso medico

source: Insoles for corrective treatment of conditions of the feet
it: Solette per il trattamento correttivo di disturbi dei piedi

source: Catheters for medical use
it: Cateteri per uso medico

source: Thermal packs for first aid purposes
it: Cuscinetti termici per i primi soccorsi

source: Tables for use in the treatment of patients
it: Tavoli per il trattamento di pazienti

source: Temperature scanners for medical use
it: Scanner della temperatura per uso medico

source: Soporific pillows for insomnia
it: Guanciali contro l'insonnia

source: Apparatus for the turning of patients
it: Apparecchi per girare i pazienti

source: Dental apparatus and instruments
it: Apparecchi e strumenti dentari

source: Apparatus for use by ileostomy patients
it: Apparecchi per pazienti con ileostomia

source: Apparatus for use in alleviating hearing disorders
it: Apparecchi per alleviare disturbi dell'udito

source: Apparatus for use in identifying periodontal disease
it: Apparecchi per l'dentificazione di malattie periodontali

source: Pressure bandages for anatomical support purposes
it: Fasciature a compressione per supporto anatomico

source: Computer controlled exercise apparatus for therapeutic use
it: Apparecchi computerizzati per l'esercizio fisico per uso terapeutico

source: Hot air therapeutic apparatus
it: Apparecchi terapeutici ad aria calda

source: Radium tubes for medical purposes
it: Ampolle radiogene per uso medico

source: Medical blankets for the cooling of patients
it: Coperte mediche per il raffreddamento di pazienti

source: Optical temperature measuring instruments for medical inspection purposes
it: Strumenti ottici per la misurazione della temperatura per controlli medici

source: Lab units for the dispensing of liquids [for medical use]
it: Attrezzi di laboratorio per l'erogazione di liquidi [per uso medico]

source: Orthopedic cushions
it: Cuscini ortopedici

source: Apparatus for orthopaedic purposes
it: Apparecchi per uso ortopedico

source: Protective breathing masks for artificial respiration
it: Maschere respiratorie protettive per la respirazione artificiale

source: Thermographic instruments for medical purposes
it: Strumenti termografici per uso medico

source: Endoscopes
it: Endoscopi

source: Endotracheal tubes
it: Tubi endotracheali

source: Exercise machines for therapeutic purposes
it: Macchine per l'esercizio fisico per uso terapeutico

source: Heart monitors to be worn during exercise
it: Monitor cardiaci da indossare durante esercizi

source: Hyperbaric oxygen chambers for medical purposes
it: Camere d'ossigeno iperbariche per uso medico

source: Appliances for washing body cavities
it: Apparecchi per lavare le cavità del corpo

source: Pins of precious materials for dental use
it: Perni in materiali preziosi per uso dentistico

source: Pipetting instruments for surgical use
it: Strumenti a pipette per uso chirurgico

source: Brushes for cleaning body cavities
it: Scovoli per pulire le cavità del corpo

source: Low frequency electric therapy apparatus
it: Apparecchi terapeutici elettrici a bassa frequenza

source: Impulse measuring instruments for medical use
it: Strumenti di misura ad impulsi per uso medico

source: Incentive spirometers for medical use
it: Spirometri di incentivazione per uso medico

source: Cushions for medical use for supporting infants while being bathed
it: Cuscini per uso medico per sostegno di bambini durante il bagno

source: Cushions for medical use, adapted to support the face
it: Cuscini per uso medico, adatti al sostegno del viso

source: Protective cups for teeth
it: Capsule protettive per denti

source: Calibration catheters
it: Cateteri di calibrazione

source: Cardiac catheters
it: Cateteri cardiaci

source: Cardiac fulguration apparatus
it: Apparecchi di folgorazione cardiaca

source: Birthing chairs
it: Poltrone per parto

source: Blankets, electric, for medical purposes
it: Coperte elettriche per uso medico

source: Electronic stimulator for medical use
it: Stimolatori elettronici per uso medico

source: Umbilical belts
it: Cinture ombelicali

source: Artificial implants
it: Impianti artificiali

source: Artificial kidneys
it: Reni artificiali

source: Artificial sleep apparatus
it: Apparecchi per sonno artificiale

source: Apparatus for the thermal treatment of cancer
it: Apparecchi per il trattamento termico di tumori

source: Apparatus for the treatment of breathing difficulties
it: Apparecchi per il trattamento di difficoltà respiratorie

source: Apparatus for use in the investigation of metabolic disorders
it: Apparecchi per l'indagine di disturbi metabolici

source: Apparatus for use in treating hearing disorders
it: Apparecchi per il trattamento di disturbi dell'udito

source: Applicators for medications
it: Applicatori per medicazioni

source: Applicators for pharmaceutical preparations
it: Applicatori per prodotti farmaceutici

source: Protective visors for surgical use
it: Visiere protettive per uso chirurgico

source: Therapeutic apparatus incorporating massaging facilities
it: Apparecchi terapeutici dotati di dispositivi per massaggi

source: Trays for holding veterinary instruments
it: Vaschette per strumenti veterinari

source: Respirators for artificial respiration
it: Respiratori per la respirazione artificiale

source: Walking frames for disabled persons
it: Deambulatori per persone disabili

source: Wheeled trolleys adapted for use as walking aids
it: Carrelli a ruote adatti come ausili per camminare

source: Apparatus for analysing gases [for medical use]
it: Apparecchi per analizzare gas [per uso medico]

source: Apparatus for blood analysis [for medical use]
it: Apparecchi per analisi del sangue [per uso medico]

source: Apparatus for dialysis for veterinary use
it: Apparecchi per la dialisi per uso veterinario

source: External defibrillators
it: Defibrillatori esterni

source: Hair prostheses
it: Protesi capillari

source: Contrivances made from natural rubber for contraceptive purposes
it: Dispositivi in gomma naturale da utilizzare per contraccezione

source: Injection sleeves for medical use
it: Guaine di iniezione per uso medico

source: Implantable pacemaking leads
it: Cavi per pacemaker impiantabili

source: Implants [prosthesis] for dental surgery
it: Impianti [protesi] per chirurgia dentale

source: Otological prosthetic appliances
it: Apparecchi prostetici otologici

source: Oxygen sensors for medical use
it: Sensori di ossigeno per uso medico

source: Bone detectors for the measurement of bone mineral content
it: Rilevatori per misurare il contenuto di minerali nelle ossa

source: Collimating position indicating apparatus for surgical use
it: Dispositivi collimatori indicanti la posizione per uso chirurgico

source: Silicone prosthetic implants
it: Impianti protesici in silicone

source: Abdominal corsets
it: Corsetti addominali

source: Electronic carbon dioxide monitors used for medical purposes
it: Monitor elettronici di rilevazione di biossido di carbonio per uso medico

source: Cardiovascular angioscopes
it: Angioscopi cardiovascolari

source: Manometer lines for medical use
it: Condotte di manometri per uso medico

source: Amalgam carriers
it: Porta amalgama

source: Tubes for veterinary use
it: Tubi per uso veterinario

source: Ultrasonic cleaning instruments for medical use
it: Apparecchi di pulizia ad ultrasuoni per uso medico

source: Supports for flat feet
it: Supporti per piedi piatti

source: Urethral probes
it: Sonde uretrali

source: Detecting instruments for medical use
it: Apparecchi di rilevazione per uso medico

source: Heads for hip prostheses
it: Teste per protesi per le anche

source: Pumps for medical use in the extraction of vapour
it: Pompe per uso medico per l'estrazione di vapori

source: Sheets [drapes] for medical use
it: Teli [tende] per uso medico

source: Electric air compressors for surgical use
it: Compressori d'aria elettrici per uso chirurgico

source: Fibre optic instruments for medical purposes
it: Strumenti a fibre ottiche per uso medico

source: Biopsy forceps
it: Pinze per biopsia

source: Blood centrifuging tubules [for medical use]
it: Tubuli per centrifugare sangue [per uso medico]

source: Orthopaedic supports for feet
it: Supporti ortopedici per i piedi

source: Sources of electromagnetic fields for use in medical treatment
it: Sorgenti di campi elettromagnetici per cure mediche

source: Specula for otoscopes
it: Speculum per otoscopi

source: Ocular implants
it: Impianti oculari

source: Oxygen masks for medical use
it: Maschere di ossigeno per uso medico

source: Nephelometric analyzers for medical diagnosis
it: Analizzatori nefelometrici per uso medico-diagnostico

source: Neurosurgical adaptors
it: Adattatori neurochirurgici

source: Medical instruments for application in human bodies
it: Strumenti medici da applicare sul corpo umano

source: Medical instruments for drug abuse testing
it: Strumenti medici per test sull'abuso di sostanze

source: Medical instruments for use in relation to hearing
it: Strumenti medici da utilizzare in relazione all'udito

source: Respiratory therapy instruments
it: Strumenti per la terapia respiratoria

source: Reversed osmosis membranes for medical use
it: Membrane a osmosi inversa per uso medico

source: Rigid endoscopes
it: Endoscopi rigidi

source: Electromedical instruments for slimming treatments
it: Apparecchiature elettromedicali per trattamenti dimagranti

source: Foot orthoses
it: Ortesi per piedi

source: Intra-aortic balloons
it: Palloncini intra-aortici

source: Intra-vascular blood gas monitoring systems
it: Sistemi di controllo dei gas nel sangue endovascolari

source: Lasers capable of producing pulsating laser beams [for medical use]
it: Laser in grado di produrre raggi laser pulsanti [per uso medico]

source: High frequency coagulation instruments for medical purposes
it: Strumenti di coagulazione ad alta frequenza per uso medico

source: High risk delivery resuscitation instruments
it: Strumenti di rianimazione per parto ad alto rischio

source: Platinum cauteries [for surgical use]
it: Cauteri di platino [per uso chirurgico]

source: Prosthetic sockets used to fasten prosthetic limbs to the body
it: Alloggiamenti protesici per il fissaggio di arti protesici al corpo

source: Prostheses for medical treatment
it: Protesi per trattamenti medici

source: Cannulae for anaesthetics with receptacles
it: Cannule per anestetici con recipienti

source: Elastic stockings [for medical purposes]
it: Calze elastiche [per uso medico]

source: Elbow guard for epicondylitis
it: Paragomiti per epicondilite

source: Emergency pelvic clamps
it: Staffe pelviche di emergenza

source: Alternating pressure pads for medical use
it: Cuscinetti a pressione alternata per uso medico

source: Anaesthesia respiration apparatus
it: Apparecchi respiratori per anestesia

source: Splinting bandages for preparing splints
it: Fasciature per la preparazione di stecche

source: Radioscopy [fluoroscopy] apparatus for medical use
it: Apparecchi di radioscopia [fluoroscopia] per uso medico

source: Real time filters being parts of x-ray monitors for medical use
it: Filtri in tempo reale parte di monitor a raggi X per uso medico

source: Refractometers for medical use
it: Rifrattometri per uso medico

source: Shaped padding for supporting parts of the body [medical use]
it: Imbottiture sagomate per sostenere parti del corpo [uso medico]

source: Fluid collection containers for medical use
it: Contenitori per la raccolta di liquidi per uso medico

source: Haematology analysers
it: Analizzatori ematologici

source: Expandable braids for insertion in bile ducts for treating stenosis
it: Lacci dilatabili per inserimento in condotte biliari per la cura di stenosi

source: Expandable braids for insertion in blood vessels for treating stenosis
it: Lacci dilatabili per inserimento in vasi sanguigni per la cura di stenosi

source: Expandable braids for insertion in oesophagus for the treatment of stenosis
it: Lacci dilatabili per inserimento nell'esofago per la cura di stenosi

source: Tracheotomy tubes
it: Tubi per tracheotomia

source: Medical apparatus for strengthening muscles of the pelvic floor
it: Apparecchi medici per rinforzare i muscoli del pavimento pelvico

source: Medical apparatus for testing the level of glucose in the blood
it: Apparecchi medici per misurare il livello di glucosio nel sangue

source: Medical apparatus for use in laparoscopy
it: Apparecchi medici per laparoscopia

source: Intraocular lenses
it: Lenti intraoculari

source: Intravenous bags for medical purposes
it: Sacchetti per flebo per uso medico

source: Intravenous infusion pumps for medical purposes
it: Pompe d'infusione endovenosa, per uso medico

source: Introducers for implanting anti-embolic filters
it: Introduttori per l'impianto di filtri anti-embolia

source: Irrigation pouches for medical use
it: Sacchetti di irrigazione per uso medico

source: Automatic medical apparatus for dosing animals by injection
it: Apparecchi medici automatici per dosaggi per iniezioni per animali

source: Bags [fitted] for use by doctors
it: Borse [accessoriate] per medici

source: Bases for waterbeds [adapted for medical use]
it: Basi per letti ad acqua [adattati per uso medico]

source: Laryngectomy protectors
it: Protezioni per laringectomia

source: Heat therapy instruments
it: Apparecchi per terapia termica

source: Hospital examination chairs
it: Sedie per esami ospedalieri

source: Orthopedic articles
it: Articoli ortopedici

source: Cervical pillows for medical use
it: Cuscini cervicali per uso medico

source: Inserts for breathing masks for medical use
it: Inserti per maschere respiratorie per uso medico

source: Castrating pincers
it: Tenaglie per castrare

source: Electric warming pads for medical use
it: Cuscini termici elettrici per uso medico

source: Anaesthetic apparatus
it: Apparecchi per l'anestesia

source: Electro-stimulation apparatus for use in therapeutic treatment
it: Apparecchi di stimolazione elettrica per trattamenti terapeutici

source: Physical therapy equipment
it: Attrezzatura per terapie fisiche

source: X-ray spectroscopy apparatus for medical use
it: Apparecchi di spettroscopia a raggi X per uso medico

source: Apparatus for the treatment of lung diseases
it: Apparecchi per il trattamento di malattie polmonari

source: Apparatus for tumour diagnosis
it: Apparecchi per la diagnosi dei tumori

source: Apparatus for use in angiography
it: Apparecchi per angiografia

source: Apparatus for use in assessing periodontal disease
it: Apparecchi per la valutazione di malattie periodontali

source: Precision sensors for medical use
it: Sensori di precisione per uso medico

source: Probes connected to microprocessing apparatus for medical diagnosis
it: Sonde collegate ad apparecchi di microelaborazione per la diagnosi medica

source: Processors for x-ray films [for medical purposes]
it: Processori per pellicole radiografiche [per uso medico]

source: Prostheses constructed in high strength porcelain affixed to the dentine structure
it: Protesi costruite in porcellana ad alta resistenza fissate alla struttura della dentina

source: Condoms for prophylactic purposes
it: Preservativi per uso profilattico

source: Lab units for the incubation of liquids [for medical use]
it: Attrezzi di laboratorio per l'incubazione di liquidi [per uso medico]

source: Apparatus for electrical muscle stimulation
it: Apparecchi per l'elettrostimolazione muscolare

source: Protective bonnets for the hair for wear by medical practitioners
it: Cuffie protettive per i capelli indossate da personale medico

source: Tongue depressors
it: Abbassalingua

source: Tonometers for measuring [medical purposes]
it: Tonometri per misurazione [uso medico]

source: Pipes for dental applications
it: Tubi per applicazioni odontoiatriche

source: Feeding bottle valves
it: Chiusure di poppatoi

source: Veterinary obstetric aids for use in the birth of live animals
it: Accessori ostetrici veterinari per il parto di animali

source: Defibrillator monitors
it: Monitor per defibrillatori

source: Suction tubes for medical purposes
it: Tubi di aspirazione per uso medico

source: Water bags for medical purposes
it: Borse per l'acqua per uso medico

source: Clips adapted for use with ostomy bags
it: Graffette da utilizzare con sacche per stomia

source: Carbon dioxide detectors for medical use
it: Rilevatori di biossido di carbonio per uso medico

source: Spittoons for medical purposes
it: Sputacchiere per uso medico

source: Stretchers, wheeled
it: Barelle a rotelle

source: Breath gas analyzers for medical diagnostics
it: Analizzatori di gas espirati per uso medico diagnostico

source: Dialysis machines for medical use
it: Macchine per la dialisi per uso medico

source: Diaphragms for contraception
it: Diaframmi per contraccezione

source: Apparatus for artificial respiration
it: Apparecchi per la respirazione artificiale

source: Apparatus for the diagnosis of cerebrovascular diseases
it: Apparecchi per la diagnosi di malattie cerebrovascolari

source: Apparatus for the diagnosis of inflammatory diseases
it: Apparecchi per la diagnosi di malattie infiammatorie

source: Apparatus for the therapeutic stimulation of the body
it: Apparecchi per la stimolazione terapeutica del corpo

source: Apparatus for the therapeutic stimulation of the muscles
it: Apparecchi per la stimolazione terapeutica dei muscoli

source: Apparatus for use in the control of incontinence
it: Apparecchi per il controllo dell'incontinenza

source: Apparatus for use in the fitting of dental prostheses
it: Apparecchi utilizzati per l'inserimento di protesi dentarie

source: Apparatus for use in the prevention of snoring
it: Apparecchi per prevenire il russare

source: Scissors for surgery
it: Forbici per la chirurgia

source: Patient litters in the nature of stretchers
it: Lettighe mediche impiegate come barelle

source: Vertebral orthopedic apparatus
it: Apparecchi ortopedici vertebrali

source: Tweezers for medical use
it: Pinzette per uso medico

source: Test electrodes for medical use
it: Elettrodi per test per uso medico

source: Therapeutic garments for animals
it: Indumenti terapeutici per animali

source: Tracheal tubes
it: Tubi tracheali

source: Protection devices against X-rays, for medical purposes
it: Dispositivi di protezione contro i raggi X per uso medico

source: Corn knives
it: Tagliacalli

source: Incubators for medical purposes
it: Incubatrici per uso medico

source: Medical apparatus and instruments
it: Apparecchi e strumenti medici

source: Water pillows for medical purposes
it: Guanciali ad acqua per uso medico

source: Water therapy apparatus for medical use
it: Apparecchi per idroterapia per uso medico

source: Apparatus for analysing substances [for medical use]
it: Apparecchi per l'analisi di sostanze [per uso medico]

source: Fumigation apparatus for medical purposes
it: Apparecchi per fumigazioni per uso medico

source: Contrivances of rubber for prophylactic purposes
it: Articoli in gomma per uso profilattico

source: Corsetry for surgical purposes
it: Corsetteria per uso chirurgico

source: Infrared apparatus for curative purposes
it: Apparecchi ad infrarossi per uso curativo

source: Periurethral prostheses
it: Protesi periuretrali

source: Physiological apparatus for medical use
it: Apparecchi fisiologici per uso medico

source: Diagnostic imaging apparatus for medical use
it: Apparecchi di diagnostica per immagini per uso medico

source: Stapling guns (Hand-operated -) for surgical use
it: Pistole sparapunti (Manuali -) per uso chirurgico

source: Sterile clothing for surgical use
it: Abbigliamento sterile per uso chirurgico

source: Implantable pacemakers
it: Pacemaker impiantabili

source: Implants [prosthesis] for use in bone grafting
it: Impianti [protesi] per innesti ossei

source: Oxygenators for medical use
it: Ossigenatori per uso medico

source: Collimating position indicating apparatus for medical use
it: Dispositivi collimatori indicanti la posizione per uso medico

source: Galvanic therapeutic appliances
it: Apparecchi terapeutici galvanici

source: Chromatogram analyzers for medical use
it: Analizzatori di cromatogrammi per uso medico

source: Electronic blood pressure meters [for medical use]
it: Sfigmomanometri elettrici [per uso medico]

source: Cardiovascular monitors
it: Monitor cardiovascolari

source: Materials for bandaging [suspensory]
it: Materiali per fasciature [di supporto]

source: Mats for effervescent bath massage
it: Tappetini per idromassaggi

source: Abdominal belts [for medical purposes]
it: Fasce addominali [per uso medico]

source: Artificial bones for implantation
it: Ossa artificiali per impianti

source: Artificial cartilage
it: Cartilagine artificiale

source: Tubes for surgical purposes
it: Tubi per uso chirurgico

source: Tubular bandages [supportive]
it: Fasciature tubolari [di sostegno]

source: Ultrasonic aspirators for washing out soft tissue parts
it: Aspiratori ad ultrasuoni per lavare parti di tessuti molli
